analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixr_regs.h
/**@} end of group SPIXR_DATA16_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_DATA8 SPIXR_DATA8
 * @brief    Register for reading and writing the FIFO.
 * @{
 */
#define MXC_F_SPIXR_DATA8_DATA_POS                     0 /**< DATA8_DATA Position */
#define MXC_F_SPIXR_DATA8_DATA                         ((uint8_t)(0xFFUL << MXC_F_SPIXR_DATA8_DATA_POS)) /**< DATA8_DATA Mask */

/**@} end of group SPIXR_DATA8_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL1 SPIXR_CTRL1
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL1_ENABLE_POS                   0 /**< CTRL1_ENABLE Position */
#define MXC_F_SPIXR_CTRL1_ENABLE                       ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_ENABLE_POS)) /**< CTRL1_ENABLE Mask */
#define MXC_V_SPIXR_CTRL1_ENABLE_DIS                   ((uint32_t)0x0UL) /**< CTRL1_ENABLE_DIS Value */
#define MXC_S_SPIXR_CTRL1_ENABLE_DIS                   (MXC_V_SPIXR_CTRL1_ENABLE_DIS << MXC_F_SPIXR_CTRL1_ENABLE_POS) /**< CTRL1_ENABLE_DIS Setting */
#define MXC_V_SPIXR_CTRL1_ENABLE_EN                    ((uint32_t)0x1UL) /**< CTRL1_ENABLE_EN Value */
#define MXC_S_SPIXR_CTRL1_ENABLE_EN                    (MXC_V_SPIXR_CTRL1_ENABLE_EN << MXC_F_SPIXR_CTRL1_ENABLE_POS) /**< CTRL1_ENABLE_EN Setting */

#define MXC_F_SPIXR_CTRL1_MASTER_POS                   1 /**< CTRL1_MASTER Position */
#define MXC_F_SPIXR_CTRL1_MASTER                       ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_MASTER_POS)) /**< CTRL1_MASTER Mask */
#define MXC_V_SPIXR_CTRL1_MASTER_DIS                   ((uint32_t)0x0UL) /**< CTRL1_MASTER_DIS Value */
#define MXC_S_SPIXR_CTRL1_MASTER_DIS                   (MXC_V_SPIXR_CTRL1_MASTER_DIS << MXC_F_SPIXR_CTRL1_MASTER_POS) /**< CTRL1_MASTER_DIS Setting */
#define MXC_V_SPIXR_CTRL1_MASTER_EN                    ((uint32_t)0x1UL) /**< CTRL1_MASTER_EN Value */
#define MXC_S_SPIXR_CTRL1_MASTER_EN                    (MXC_V_SPIXR_CTRL1_MASTER_EN << MXC_F_SPIXR_CTRL1_MASTER_POS) /**< CTRL1_MASTER_EN Setting */

#define MXC_F_SPIXR_CTRL1_SS_IO_POS                    4 /**< CTRL1_SS_IO Position */
#define MXC_F_SPIXR_CTRL1_SS_IO                        ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_SS_IO_POS)) /**< CTRL1_SS_IO Mask */
#define MXC_V_SPIXR_CTRL1_SS_IO_OUTPUT                 ((uint32_t)0x0UL) /**< CTRL1_SS_IO_OUTPUT Value */
#define MXC_S_SPIXR_CTRL1_SS_IO_OUTPUT                 (MXC_V_SPIXR_CTRL1_SS_IO_OUTPUT << MXC_F_SPIXR_CTRL1_SS_IO_POS) /**< CTRL1_SS_IO_OUTPUT Setting */
#define MXC_V_SPIXR_CTRL1_SS_IO_INPUT                  ((uint32_t)0x1UL) /**< CTRL1_SS_IO_INPUT Value */
#define MXC_S_SPIXR_CTRL1_SS_IO_INPUT                  (MXC_V_SPIXR_CTRL1_SS_IO_INPUT << MXC_F_SPIXR_CTRL1_SS_IO_POS) /**< CTRL1_SS_IO_INPUT Setting */

#define MXC_F_SPIXR_CTRL1_START_POS                    5 /**< CTRL1_START Position */
#define MXC_F_SPIXR_CTRL1_START                        ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_START_POS)) /**< CTRL1_START Mask */
#define MXC_V_SPIXR_CTRL1_START_START                  ((uint32_t)0x1UL) /**< CTRL1_START_START Value */
#define MXC_S_SPIXR_CTRL1_START_START                  (MXC_V_SPIXR_CTRL1_START_START << MXC_F_SPIXR_CTRL1_START_POS) /**< CTRL1_START_START Setting */

#define MXC_F_SPIXR_CTRL1_SS_CTRL_POS                  8 /**< CTRL1_SS_CTRL Position */
#define MXC_F_SPIXR_CTRL1_SS_CTRL                      ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_SS_CTRL_POS)) /**< CTRL1_SS_CTRL Mask */
#define MXC_V_SPIXR_CTRL1_SS_CTRL_DEASSERT             ((uint32_t)0x0UL) /**< CTRL1_SS_CTRL_DEASSERT Value */
#define MXC_S_SPIXR_CTRL1_SS_CTRL_DEASSERT             (MXC_V_SPIXR_CTRL1_SS_CTRL_DEASSERT << MXC_F_SPIXR_CTRL1_SS_CTRL_POS) /**< CTRL1_SS_CTRL_DEASSERT Setting */
#define MXC_V_SPIXR_CTRL1_SS_CTRL_ASSERT               ((uint32_t)0x1UL) /**< CTRL1_SS_CTRL_ASSERT Value */
#define MXC_S_SPIXR_CTRL1_SS_CTRL_ASSERT               (MXC_V_SPIXR_CTRL1_SS_CTRL_ASSERT << MXC_F_SPIXR_CTRL1_SS_CTRL_POS) /**< CTRL1_SS_CTRL_ASSERT Setting */

#define MXC_F_SPIXR_CTRL1_SS_POS                       16 /**< CTRL1_SS Position */
#define MXC_F_SPIXR_CTRL1_SS                           ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL1_SS_POS)) /**< CTRL1_SS Mask */

/**@} end of group SPIXR_CTRL1_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL2 SPIXR_CTRL2
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL2_TX_NUM_CHAR_POS              0 /**< CTRL2_TX_NUM_CHAR Position */
#define MXC_F_SPIXR_CTRL2_TX_NUM_CHAR                  ((uint32_t)(0xFFFFUL << MXC_F_SPIXR_CTRL2_TX_NUM_CHAR_POS)) /**< CTRL2_TX_NUM_CHAR Mask */

#define MXC_F_SPIXR_CTRL2_RX_NUM_CHAR_POS              16 /**< CTRL2_RX_NUM_CHAR Position */
#define MXC_F_SPIXR_CTRL2_RX_NUM_CHAR                  ((uint32_t)(0xFFFFUL << MXC_F_SPIXR_CTRL2_RX_NUM_CHAR_POS)) /**< CTRL2_RX_NUM_CHAR Mask */

/**@} end of group SPIXR_CTRL2_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_CTRL3 SPIXR_CTRL3
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_CTRL3_CPHA_POS                     0 /**< CTRL3_CPHA Position */
#define MXC_F_SPIXR_CTRL3_CPHA                         ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL3_CPHA_POS)) /**< CTRL3_CPHA Mask */
#define MXC_V_SPIXR_CTRL3_CPHA_RISINGEDGE              ((uint32_t)0x0UL) /**< CTRL3_CPHA_RISINGEDGE Value */
#define MXC_S_SPIXR_CTRL3_CPHA_RISINGEDGE              (MXC_V_SPIXR_CTRL3_CPHA_RISINGEDGE << MXC_F_SPIXR_CTRL3_CPHA_POS) /**< CTRL3_CPHA_RISINGEDGE Setting */
#define MXC_V_SPIXR_CTRL3_CPHA_FALLINGEDGE             ((uint32_t)0x1UL) /**< CTRL3_CPHA_FALLINGEDGE Value */
#define MXC_S_SPIXR_CTRL3_CPHA_FALLINGEDGE             (MXC_V_SPIXR_CTRL3_CPHA_FALLINGEDGE << MXC_F_SPIXR_CTRL3_CPHA_POS) /**< CTRL3_CPHA_FALLINGEDGE Setting */

#define MXC_F_SPIXR_CTRL3_CPOL_POS                     1 /**< CTRL3_CPOL Position */
#define MXC_F_SPIXR_CTRL3_CPOL                         ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL3_CPOL_POS)) /**< CTRL3_CPOL Mask */
#define MXC_V_SPIXR_CTRL3_CPOL_NORMAL                  ((uint32_t)0x0UL) /**< CTRL3_CPOL_NORMAL Value */
#define MXC_S_SPIXR_CTRL3_CPOL_NORMAL                  (MXC_V_SPIXR_CTRL3_CPOL_NORMAL << MXC_F_SPIXR_CTRL3_CPOL_POS) /**< CTRL3_CPOL_NORMAL Setting */
#define MXC_V_SPIXR_CTRL3_CPOL_INVERTED                ((uint32_t)0x1UL) /**< CTRL3_CPOL_INVERTED Value */
#define MXC_S_SPIXR_CTRL3_CPOL_INVERTED                (MXC_V_SPIXR_CTRL3_CPOL_INVERTED << MXC_F_SPIXR_CTRL3_CPOL_POS) /**< CTRL3_CPOL_INVERTED Setting */

#define MXC_F_SPIXR_CTRL3_SCLK_INV_POS                 4 /**< CTRL3_SCLK_INV Position */
#define MXC_F_SPIXR_CTRL3_SCLK_INV                     ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL3_SCLK_INV_POS)) /**< CTRL3_SCLK_INV Mask */
#define MXC_V_SPIXR_CTRL3_SCLK_INV_NORMAL              ((uint32_t)0x0UL) /**< CTRL3_SCLK_INV_NORMAL Value */
#define MXC_S_SPIXR_CTRL3_SCLK_INV_NORMAL              (MXC_V_SPIXR_CTRL3_SCLK_INV_NORMAL << MXC_F_SPIXR_CTRL3_SCLK_INV_POS) /**< CTRL3_SCLK_INV_NORMAL Setting */

#define MXC_F_SPIXR_CTRL3_NUMBITS_POS                  8 /**< CTRL3_NUMBITS Position */
#define MXC_F_SPIXR_CTRL3_NUMBITS                      ((uint32_t)(0xFUL << MXC_F_SPIXR_CTRL3_NUMBITS_POS)) /**< CTRL3_NUMBITS Mask */
#define MXC_V_SPIXR_CTRL3_NUMBITS_16BITS               ((uint32_t)0x0UL) /**< CTRL3_NUMBITS_16BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_16BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_16BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_16BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_1BITS                ((uint32_t)0x1UL) /**< CTRL3_NUMBITS_1BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_1BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_1BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_1BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_2BITS                ((uint32_t)0x2UL) /**< CTRL3_NUMBITS_2BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_2BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_2BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_2BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_3BITS                ((uint32_t)0x3UL) /**< CTRL3_NUMBITS_3BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_3BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_3BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_3BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_4BITS                ((uint32_t)0x4UL) /**< CTRL3_NUMBITS_4BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_4BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_4BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_4BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_5BITS                ((uint32_t)0x5UL) /**< CTRL3_NUMBITS_5BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_5BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_5BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_5BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_6BITS                ((uint32_t)0x6UL) /**< CTRL3_NUMBITS_6BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_6BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_6BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_6BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_7BITS                ((uint32_t)0x7UL) /**< CTRL3_NUMBITS_7BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_7BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_7BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_7BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_8BITS                ((uint32_t)0x8UL) /**< CTRL3_NUMBITS_8BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_8BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_8BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_8BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_9BITS                ((uint32_t)0x9UL) /**< CTRL3_NUMBITS_9BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_9BITS                (MXC_V_SPIXR_CTRL3_NUMBITS_9BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_9BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_10BITS               ((uint32_t)0xAUL) /**< CTRL3_NUMBITS_10BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_10BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_10BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_10BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_11BITS               ((uint32_t)0xBUL) /**< CTRL3_NUMBITS_11BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_11BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_11BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_11BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_12BITS               ((uint32_t)0xCUL) /**< CTRL3_NUMBITS_12BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_12BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_12BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_12BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_13BITS               ((uint32_t)0xDUL) /**< CTRL3_NUMBITS_13BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_13BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_13BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_13BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_14BITS               ((uint32_t)0xEUL) /**< CTRL3_NUMBITS_14BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_14BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_14BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_14BITS Setting */
#define MXC_V_SPIXR_CTRL3_NUMBITS_15BITS               ((uint32_t)0xFUL) /**< CTRL3_NUMBITS_15BITS Value */
#define MXC_S_SPIXR_CTRL3_NUMBITS_15BITS               (MXC_V_SPIXR_CTRL3_NUMBITS_15BITS << MXC_F_SPIXR_CTRL3_NUMBITS_POS) /**< CTRL3_NUMBITS_15BITS Setting */

#define MXC_F_SPIXR_CTRL3_DATA_WIDTH_POS               12 /**< CTRL3_DATA_WIDTH Position */
#define MXC_F_SPIXR_CTRL3_DATA_WIDTH                   ((uint32_t)(0x3UL << MXC_F_SPIXR_CTRL3_DATA_WIDTH_POS)) /**< CTRL3_DATA_WIDTH Mask */
#define MXC_V_SPIXR_CTRL3_DATA_WIDTH_MONO              ((uint32_t)0x0UL) /**< CTRL3_DATA_WIDTH_MONO Value */
#define MXC_S_SPIXR_CTRL3_DATA_WIDTH_MONO              (MXC_V_SPIXR_CTRL3_DATA_WIDTH_MONO << MXC_F_SPIXR_CTRL3_DATA_WIDTH_POS) /**< CTRL3_DATA_WIDTH_MONO Setting */
#define MXC_V_SPIXR_CTRL3_DATA_WIDTH_DUAL              ((uint32_t)0x1UL) /**< CTRL3_DATA_WIDTH_DUAL Value */
#define MXC_S_SPIXR_CTRL3_DATA_WIDTH_DUAL              (MXC_V_SPIXR_CTRL3_DATA_WIDTH_DUAL << MXC_F_SPIXR_CTRL3_DATA_WIDTH_POS) /**< CTRL3_DATA_WIDTH_DUAL Setting */
#define MXC_V_SPIXR_CTRL3_DATA_WIDTH_QUAD              ((uint32_t)0x2UL) /**< CTRL3_DATA_WIDTH_QUAD Value */
#define MXC_S_SPIXR_CTRL3_DATA_WIDTH_QUAD              (MXC_V_SPIXR_CTRL3_DATA_WIDTH_QUAD << MXC_F_SPIXR_CTRL3_DATA_WIDTH_POS) /**< CTRL3_DATA_WIDTH_QUAD Setting */

