analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixr_regs.h
#define MXC_F_SPIXR_CTRL3_THREE_WIRE_POS               15 /**< CTRL3_THREE_WIRE Position */
#define MXC_F_SPIXR_CTRL3_THREE_WIRE                   ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL3_THREE_WIRE_POS)) /**< CTRL3_THREE_WIRE Mask */
#define MXC_V_SPIXR_CTRL3_THREE_WIRE_4WIRE             ((uint32_t)0x0UL) /**< CTRL3_THREE_WIRE_4WIRE Value */
#define MXC_S_SPIXR_CTRL3_THREE_WIRE_4WIRE             (MXC_V_SPIXR_CTRL3_THREE_WIRE_4WIRE << MXC_F_SPIXR_CTRL3_THREE_WIRE_POS) /**< CTRL3_THREE_WIRE_4WIRE Setting */
#define MXC_V_SPIXR_CTRL3_THREE_WIRE_3WIRE             ((uint32_t)0x1UL) /**< CTRL3_THREE_WIRE_3WIRE Value */
#define MXC_S_SPIXR_CTRL3_THREE_WIRE_3WIRE             (MXC_V_SPIXR_CTRL3_THREE_WIRE_3WIRE << MXC_F_SPIXR_CTRL3_THREE_WIRE_POS) /**< CTRL3_THREE_WIRE_3WIRE Setting */

#define MXC_F_SPIXR_CTRL3_SSPOL_POS                    16 /**< CTRL3_SSPOL Position */
#define MXC_F_SPIXR_CTRL3_SSPOL                        ((uint32_t)(0x1UL << MXC_F_SPIXR_CTRL3_SSPOL_POS)) /**< CTRL3_SSPOL Mask */
#define MXC_V_SPIXR_CTRL3_SSPOL_ACTIVELOW              ((uint32_t)0x0UL) /**< CTRL3_SSPOL_ACTIVELOW Value */
#define MXC_S_SPIXR_CTRL3_SSPOL_ACTIVELOW              (MXC_V_SPIXR_CTRL3_SSPOL_ACTIVELOW << MXC_F_SPIXR_CTRL3_SSPOL_POS) /**< CTRL3_SSPOL_ACTIVELOW Setting */
#define MXC_V_SPIXR_CTRL3_SSPOL_ACTIVEHIGH             ((uint32_t)0x1UL) /**< CTRL3_SSPOL_ACTIVEHIGH Value */
#define MXC_S_SPIXR_CTRL3_SSPOL_ACTIVEHIGH             (MXC_V_SPIXR_CTRL3_SSPOL_ACTIVEHIGH << MXC_F_SPIXR_CTRL3_SSPOL_POS) /**< CTRL3_SSPOL_ACTIVEHIGH Setting */

/**@} end of group SPIXR_CTRL3_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_SS_TIME SPIXR_SS_TIME
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPIXR_SS_TIME_SSACT1_POS                 0 /**< SS_TIME_SSACT1 Position */
#define MXC_F_SPIXR_SS_TIME_SSACT1                     ((uint32_t)(0xFFUL << MXC_F_SPIXR_SS_TIME_SSACT1_POS)) /**< SS_TIME_SSACT1 Mask */

#define MXC_F_SPIXR_SS_TIME_SSACT2_POS                 8 /**< SS_TIME_SSACT2 Position */
#define MXC_F_SPIXR_SS_TIME_SSACT2                     ((uint32_t)(0xFFUL << MXC_F_SPIXR_SS_TIME_SSACT2_POS)) /**< SS_TIME_SSACT2 Mask */

#define MXC_F_SPIXR_SS_TIME_SSINACT_POS                16 /**< SS_TIME_SSINACT Position */
#define MXC_F_SPIXR_SS_TIME_SSINACT                    ((uint32_t)(0xFFUL << MXC_F_SPIXR_SS_TIME_SSINACT_POS)) /**< SS_TIME_SSINACT Mask */

/**@} end of group SPIXR_SS_TIME_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_BRG_CTRL SPIXR_BRG_CTRL
 * @brief    Register for controlling SPI clock rate.
 * @{
 */
#define MXC_F_SPIXR_BRG_CTRL_LO_POS                    0 /**< BRG_CTRL_LO Position */
#define MXC_F_SPIXR_BRG_CTRL_LO                        ((uint32_t)(0xFFUL << MXC_F_SPIXR_BRG_CTRL_LO_POS)) /**< BRG_CTRL_LO Mask */

#define MXC_F_SPIXR_BRG_CTRL_HI_POS                    8 /**< BRG_CTRL_HI Position */
#define MXC_F_SPIXR_BRG_CTRL_HI                        ((uint32_t)(0xFFUL << MXC_F_SPIXR_BRG_CTRL_HI_POS)) /**< BRG_CTRL_HI Mask */

#define MXC_F_SPIXR_BRG_CTRL_SCALE_POS                 16 /**< BRG_CTRL_SCALE Position */
#define MXC_F_SPIXR_BRG_CTRL_SCALE                     ((uint32_t)(0xFUL << MXC_F_SPIXR_BRG_CTRL_SCALE_POS)) /**< BRG_CTRL_SCALE Mask */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV1                ((uint32_t)0x0UL) /**< BRG_CTRL_SCALE_DIV1 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV1                (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV1 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV1 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV2                ((uint32_t)0x1UL) /**< BRG_CTRL_SCALE_DIV2 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV2                (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV2 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV2 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV4                ((uint32_t)0x2UL) /**< BRG_CTRL_SCALE_DIV4 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV4                (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV4 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV4 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV8                ((uint32_t)0x3UL) /**< BRG_CTRL_SCALE_DIV8 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV8                (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV8 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV8 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV16               ((uint32_t)0x4UL) /**< BRG_CTRL_SCALE_DIV16 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV16               (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV16 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV16 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV32               ((uint32_t)0x5UL) /**< BRG_CTRL_SCALE_DIV32 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV32               (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV32 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV32 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV64               ((uint32_t)0x6UL) /**< BRG_CTRL_SCALE_DIV64 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV64               (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV64 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV64 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV128              ((uint32_t)0x7UL) /**< BRG_CTRL_SCALE_DIV128 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV128              (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV128 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV128 Setting */
#define MXC_V_SPIXR_BRG_CTRL_SCALE_DIV256              ((uint32_t)0x8UL) /**< BRG_CTRL_SCALE_DIV256 Value */
#define MXC_S_SPIXR_BRG_CTRL_SCALE_DIV256              (MXC_V_SPIXR_BRG_CTRL_SCALE_DIV256 << MXC_F_SPIXR_BRG_CTRL_SCALE_POS) /**< BRG_CTRL_SCALE_DIV256 Setting */

/**@} end of group SPIXR_BRG_CTRL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_DMA SPIXR_DMA
 * @brief    Register for controlling DMA.
 * @{
 */
#define MXC_F_SPIXR_DMA_TX_FIFO_LEVEL_POS              0 /**< DMA_TX_FIFO_LEVEL Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_LEVEL                  ((uint32_t)(0x1FUL << MXC_F_SPIXR_DMA_TX_FIFO_LEVEL_POS)) /**< DMA_TX_FIFO_LEVEL Mask */

#define MXC_F_SPIXR_DMA_TX_FIFO_EN_POS                 6 /**< DMA_TX_FIFO_EN Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_EN                     ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_TX_FIFO_EN_POS)) /**< DMA_TX_FIFO_EN Mask */
#define MXC_V_SPIXR_DMA_TX_FIFO_EN_DIS                 ((uint32_t)0x0UL) /**< DMA_TX_FIFO_EN_DIS Value */
#define MXC_S_SPIXR_DMA_TX_FIFO_EN_DIS                 (MXC_V_SPIXR_DMA_TX_FIFO_EN_DIS << MXC_F_SPIXR_DMA_TX_FIFO_EN_POS) /**< DMA_TX_FIFO_EN_DIS Setting */
#define MXC_V_SPIXR_DMA_TX_FIFO_EN_EN                  ((uint32_t)0x1UL) /**< DMA_TX_FIFO_EN_EN Value */
#define MXC_S_SPIXR_DMA_TX_FIFO_EN_EN                  (MXC_V_SPIXR_DMA_TX_FIFO_EN_EN << MXC_F_SPIXR_DMA_TX_FIFO_EN_POS) /**< DMA_TX_FIFO_EN_EN Setting */

#define MXC_F_SPIXR_DMA_TX_FIFO_CLEAR_POS              7 /**< DMA_TX_FIFO_CLEAR Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_CLEAR                  ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_TX_FIFO_CLEAR_POS)) /**< DMA_TX_FIFO_CLEAR Mask */
#define MXC_V_SPIXR_DMA_TX_FIFO_CLEAR_CLEAR            ((uint32_t)0x1UL) /**< DMA_TX_FIFO_CLEAR_CLEAR Value */
#define MXC_S_SPIXR_DMA_TX_FIFO_CLEAR_CLEAR            (MXC_V_SPIXR_DMA_TX_FIFO_CLEAR_CLEAR << MXC_F_SPIXR_DMA_TX_FIFO_CLEAR_POS) /**< DMA_TX_FIFO_CLEAR_CLEAR Setting */

#define MXC_F_SPIXR_DMA_TX_FIFO_CNT_POS                8 /**< DMA_TX_FIFO_CNT Position */
#define MXC_F_SPIXR_DMA_TX_FIFO_CNT                    ((uint32_t)(0x3FUL << MXC_F_SPIXR_DMA_TX_FIFO_CNT_POS)) /**< DMA_TX_FIFO_CNT Mask */

#define MXC_F_SPIXR_DMA_TX_DMA_EN_POS                  15 /**< DMA_TX_DMA_EN Position */
#define MXC_F_SPIXR_DMA_TX_DMA_EN                      ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_TX_DMA_EN_POS)) /**< DMA_TX_DMA_EN Mask */
#define MXC_V_SPIXR_DMA_TX_DMA_EN_DIS                  ((uint32_t)0x0UL) /**< DMA_TX_DMA_EN_DIS Value */
#define MXC_S_SPIXR_DMA_TX_DMA_EN_DIS                  (MXC_V_SPIXR_DMA_TX_DMA_EN_DIS << MXC_F_SPIXR_DMA_TX_DMA_EN_POS) /**< DMA_TX_DMA_EN_DIS Setting */
#define MXC_V_SPIXR_DMA_TX_DMA_EN_EN                   ((uint32_t)0x1UL) /**< DMA_TX_DMA_EN_EN Value */
#define MXC_S_SPIXR_DMA_TX_DMA_EN_EN                   (MXC_V_SPIXR_DMA_TX_DMA_EN_EN << MXC_F_SPIXR_DMA_TX_DMA_EN_POS) /**< DMA_TX_DMA_EN_EN Setting */

#define MXC_F_SPIXR_DMA_RX_FIFO_LEVEL_POS              16 /**< DMA_RX_FIFO_LEVEL Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_LEVEL                  ((uint32_t)(0x1FUL << MXC_F_SPIXR_DMA_RX_FIFO_LEVEL_POS)) /**< DMA_RX_FIFO_LEVEL Mask */

#define MXC_F_SPIXR_DMA_RX_FIFO_EN_POS                 22 /**< DMA_RX_FIFO_EN Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_EN                     ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_RX_FIFO_EN_POS)) /**< DMA_RX_FIFO_EN Mask */
#define MXC_V_SPIXR_DMA_RX_FIFO_EN_DIS                 ((uint32_t)0x0UL) /**< DMA_RX_FIFO_EN_DIS Value */
#define MXC_S_SPIXR_DMA_RX_FIFO_EN_DIS                 (MXC_V_SPIXR_DMA_RX_FIFO_EN_DIS << MXC_F_SPIXR_DMA_RX_FIFO_EN_POS) /**< DMA_RX_FIFO_EN_DIS Setting */
#define MXC_V_SPIXR_DMA_RX_FIFO_EN_EN                  ((uint32_t)0x1UL) /**< DMA_RX_FIFO_EN_EN Value */
#define MXC_S_SPIXR_DMA_RX_FIFO_EN_EN                  (MXC_V_SPIXR_DMA_RX_FIFO_EN_EN << MXC_F_SPIXR_DMA_RX_FIFO_EN_POS) /**< DMA_RX_FIFO_EN_EN Setting */

#define MXC_F_SPIXR_DMA_RX_FIFO_CLEAR_POS              23 /**< DMA_RX_FIFO_CLEAR Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_CLEAR                  ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_RX_FIFO_CLEAR_POS)) /**< DMA_RX_FIFO_CLEAR Mask */
#define MXC_V_SPIXR_DMA_RX_FIFO_CLEAR_CLEAR            ((uint32_t)0x1UL) /**< DMA_RX_FIFO_CLEAR_CLEAR Value */
#define MXC_S_SPIXR_DMA_RX_FIFO_CLEAR_CLEAR            (MXC_V_SPIXR_DMA_RX_FIFO_CLEAR_CLEAR << MXC_F_SPIXR_DMA_RX_FIFO_CLEAR_POS) /**< DMA_RX_FIFO_CLEAR_CLEAR Setting */

#define MXC_F_SPIXR_DMA_RX_FIFO_CNT_POS                24 /**< DMA_RX_FIFO_CNT Position */
#define MXC_F_SPIXR_DMA_RX_FIFO_CNT                    ((uint32_t)(0x3FUL << MXC_F_SPIXR_DMA_RX_FIFO_CNT_POS)) /**< DMA_RX_FIFO_CNT Mask */

#define MXC_F_SPIXR_DMA_RX_DMA_EN_POS                  31 /**< DMA_RX_DMA_EN Position */
#define MXC_F_SPIXR_DMA_RX_DMA_EN                      ((uint32_t)(0x1UL << MXC_F_SPIXR_DMA_RX_DMA_EN_POS)) /**< DMA_RX_DMA_EN Mask */
#define MXC_V_SPIXR_DMA_RX_DMA_EN_DIS                  ((uint32_t)0x0UL) /**< DMA_RX_DMA_EN_DIS Value */
#define MXC_S_SPIXR_DMA_RX_DMA_EN_DIS                  (MXC_V_SPIXR_DMA_RX_DMA_EN_DIS << MXC_F_SPIXR_DMA_RX_DMA_EN_POS) /**< DMA_RX_DMA_EN_DIS Setting */
#define MXC_V_SPIXR_DMA_RX_DMA_EN_EN                   ((uint32_t)0x1UL) /**< DMA_RX_DMA_EN_EN Value */
#define MXC_S_SPIXR_DMA_RX_DMA_EN_EN                   (MXC_V_SPIXR_DMA_RX_DMA_EN_EN << MXC_F_SPIXR_DMA_RX_DMA_EN_POS) /**< DMA_RX_DMA_EN_EN Setting */

/**@} end of group SPIXR_DMA_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_INT_FL SPIXR_INT_FL
 * @brief    Register for reading and clearing interrupt flags. All bits are write 1 to
 *           clear.
 * @{
 */
#define MXC_F_SPIXR_INT_FL_TX_LEVEL_POS                0 /**< INT_FL_TX_LEVEL Position */
#define MXC_F_SPIXR_INT_FL_TX_LEVEL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_TX_LEVEL_POS)) /**< INT_FL_TX_LEVEL Mask */
#define MXC_V_SPIXR_INT_FL_TX_LEVEL_CLEAR              ((uint32_t)0x1UL) /**< INT_FL_TX_LEVEL_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_TX_LEVEL_CLEAR              (MXC_V_SPIXR_INT_FL_TX_LEVEL_CLEAR << MXC_F_SPIXR_INT_FL_TX_LEVEL_POS) /**< INT_FL_TX_LEVEL_CLEAR Setting */

