analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixr_regs.h
#define MXC_F_SPIXR_INT_FL_TX_EMPTY_POS                1 /**< INT_FL_TX_EMPTY Position */
#define MXC_F_SPIXR_INT_FL_TX_EMPTY                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_TX_EMPTY_POS)) /**< INT_FL_TX_EMPTY Mask */
#define MXC_V_SPIXR_INT_FL_TX_EMPTY_CLEAR              ((uint32_t)0x1UL) /**< INT_FL_TX_EMPTY_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_TX_EMPTY_CLEAR              (MXC_V_SPIXR_INT_FL_TX_EMPTY_CLEAR << MXC_F_SPIXR_INT_FL_TX_EMPTY_POS) /**< INT_FL_TX_EMPTY_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_RX_LEVEL_POS                2 /**< INT_FL_RX_LEVEL Position */
#define MXC_F_SPIXR_INT_FL_RX_LEVEL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_RX_LEVEL_POS)) /**< INT_FL_RX_LEVEL Mask */
#define MXC_V_SPIXR_INT_FL_RX_LEVEL_CLEAR              ((uint32_t)0x1UL) /**< INT_FL_RX_LEVEL_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_RX_LEVEL_CLEAR              (MXC_V_SPIXR_INT_FL_RX_LEVEL_CLEAR << MXC_F_SPIXR_INT_FL_RX_LEVEL_POS) /**< INT_FL_RX_LEVEL_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_RX_FULL_POS                 3 /**< INT_FL_RX_FULL Position */
#define MXC_F_SPIXR_INT_FL_RX_FULL                     ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_RX_FULL_POS)) /**< INT_FL_RX_FULL Mask */
#define MXC_V_SPIXR_INT_FL_RX_FULL_CLEAR               ((uint32_t)0x1UL) /**< INT_FL_RX_FULL_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_RX_FULL_CLEAR               (MXC_V_SPIXR_INT_FL_RX_FULL_CLEAR << MXC_F_SPIXR_INT_FL_RX_FULL_POS) /**< INT_FL_RX_FULL_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_SSA_POS                     4 /**< INT_FL_SSA Position */
#define MXC_F_SPIXR_INT_FL_SSA                         ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_SSA_POS)) /**< INT_FL_SSA Mask */
#define MXC_V_SPIXR_INT_FL_SSA_CLEAR                   ((uint32_t)0x1UL) /**< INT_FL_SSA_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_SSA_CLEAR                   (MXC_V_SPIXR_INT_FL_SSA_CLEAR << MXC_F_SPIXR_INT_FL_SSA_POS) /**< INT_FL_SSA_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_SSD_POS                     5 /**< INT_FL_SSD Position */
#define MXC_F_SPIXR_INT_FL_SSD                         ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_SSD_POS)) /**< INT_FL_SSD Mask */
#define MXC_V_SPIXR_INT_FL_SSD_CLEAR                   ((uint32_t)0x1UL) /**< INT_FL_SSD_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_SSD_CLEAR                   (MXC_V_SPIXR_INT_FL_SSD_CLEAR << MXC_F_SPIXR_INT_FL_SSD_POS) /**< INT_FL_SSD_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_FAULT_POS                   8 /**< INT_FL_FAULT Position */
#define MXC_F_SPIXR_INT_FL_FAULT                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_FAULT_POS)) /**< INT_FL_FAULT Mask */
#define MXC_V_SPIXR_INT_FL_FAULT_CLEAR                 ((uint32_t)0x1UL) /**< INT_FL_FAULT_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_FAULT_CLEAR                 (MXC_V_SPIXR_INT_FL_FAULT_CLEAR << MXC_F_SPIXR_INT_FL_FAULT_POS) /**< INT_FL_FAULT_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_ABORT_POS                   9 /**< INT_FL_ABORT Position */
#define MXC_F_SPIXR_INT_FL_ABORT                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_ABORT_POS)) /**< INT_FL_ABORT Mask */
#define MXC_V_SPIXR_INT_FL_ABORT_CLEAR                 ((uint32_t)0x1UL) /**< INT_FL_ABORT_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_ABORT_CLEAR                 (MXC_V_SPIXR_INT_FL_ABORT_CLEAR << MXC_F_SPIXR_INT_FL_ABORT_POS) /**< INT_FL_ABORT_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_M_DONE_POS                  11 /**< INT_FL_M_DONE Position */
#define MXC_F_SPIXR_INT_FL_M_DONE                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_M_DONE_POS)) /**< INT_FL_M_DONE Mask */
#define MXC_V_SPIXR_INT_FL_M_DONE_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_M_DONE_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_M_DONE_CLEAR                (MXC_V_SPIXR_INT_FL_M_DONE_CLEAR << MXC_F_SPIXR_INT_FL_M_DONE_POS) /**< INT_FL_M_DONE_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_TX_OVR_POS                  12 /**< INT_FL_TX_OVR Position */
#define MXC_F_SPIXR_INT_FL_TX_OVR                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_TX_OVR_POS)) /**< INT_FL_TX_OVR Mask */
#define MXC_V_SPIXR_INT_FL_TX_OVR_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_TX_OVR_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_TX_OVR_CLEAR                (MXC_V_SPIXR_INT_FL_TX_OVR_CLEAR << MXC_F_SPIXR_INT_FL_TX_OVR_POS) /**< INT_FL_TX_OVR_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_TX_UND_POS                  13 /**< INT_FL_TX_UND Position */
#define MXC_F_SPIXR_INT_FL_TX_UND                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_TX_UND_POS)) /**< INT_FL_TX_UND Mask */
#define MXC_V_SPIXR_INT_FL_TX_UND_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_TX_UND_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_TX_UND_CLEAR                (MXC_V_SPIXR_INT_FL_TX_UND_CLEAR << MXC_F_SPIXR_INT_FL_TX_UND_POS) /**< INT_FL_TX_UND_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_RX_OVR_POS                  14 /**< INT_FL_RX_OVR Position */
#define MXC_F_SPIXR_INT_FL_RX_OVR                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_RX_OVR_POS)) /**< INT_FL_RX_OVR Mask */
#define MXC_V_SPIXR_INT_FL_RX_OVR_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_RX_OVR_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_RX_OVR_CLEAR                (MXC_V_SPIXR_INT_FL_RX_OVR_CLEAR << MXC_F_SPIXR_INT_FL_RX_OVR_POS) /**< INT_FL_RX_OVR_CLEAR Setting */

#define MXC_F_SPIXR_INT_FL_RX_UND_POS                  15 /**< INT_FL_RX_UND Position */
#define MXC_F_SPIXR_INT_FL_RX_UND                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_FL_RX_UND_POS)) /**< INT_FL_RX_UND Mask */
#define MXC_V_SPIXR_INT_FL_RX_UND_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_RX_UND_CLEAR Value */
#define MXC_S_SPIXR_INT_FL_RX_UND_CLEAR                (MXC_V_SPIXR_INT_FL_RX_UND_CLEAR << MXC_F_SPIXR_INT_FL_RX_UND_POS) /**< INT_FL_RX_UND_CLEAR Setting */

/**@} end of group SPIXR_INT_FL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_INT_EN SPIXR_INT_EN
 * @brief    Register for enabling interrupts.
 * @{
 */
#define MXC_F_SPIXR_INT_EN_TX_LEVEL_POS                0 /**< INT_EN_TX_LEVEL Position */
#define MXC_F_SPIXR_INT_EN_TX_LEVEL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_TX_LEVEL_POS)) /**< INT_EN_TX_LEVEL Mask */
#define MXC_V_SPIXR_INT_EN_TX_LEVEL_DIS                ((uint32_t)0x0UL) /**< INT_EN_TX_LEVEL_DIS Value */
#define MXC_S_SPIXR_INT_EN_TX_LEVEL_DIS                (MXC_V_SPIXR_INT_EN_TX_LEVEL_DIS << MXC_F_SPIXR_INT_EN_TX_LEVEL_POS) /**< INT_EN_TX_LEVEL_DIS Setting */
#define MXC_V_SPIXR_INT_EN_TX_LEVEL_EN                 ((uint32_t)0x1UL) /**< INT_EN_TX_LEVEL_EN Value */
#define MXC_S_SPIXR_INT_EN_TX_LEVEL_EN                 (MXC_V_SPIXR_INT_EN_TX_LEVEL_EN << MXC_F_SPIXR_INT_EN_TX_LEVEL_POS) /**< INT_EN_TX_LEVEL_EN Setting */

#define MXC_F_SPIXR_INT_EN_TX_EMPTY_POS                1 /**< INT_EN_TX_EMPTY Position */
#define MXC_F_SPIXR_INT_EN_TX_EMPTY                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_TX_EMPTY_POS)) /**< INT_EN_TX_EMPTY Mask */
#define MXC_V_SPIXR_INT_EN_TX_EMPTY_DIS                ((uint32_t)0x0UL) /**< INT_EN_TX_EMPTY_DIS Value */
#define MXC_S_SPIXR_INT_EN_TX_EMPTY_DIS                (MXC_V_SPIXR_INT_EN_TX_EMPTY_DIS << MXC_F_SPIXR_INT_EN_TX_EMPTY_POS) /**< INT_EN_TX_EMPTY_DIS Setting */
#define MXC_V_SPIXR_INT_EN_TX_EMPTY_EN                 ((uint32_t)0x1UL) /**< INT_EN_TX_EMPTY_EN Value */
#define MXC_S_SPIXR_INT_EN_TX_EMPTY_EN                 (MXC_V_SPIXR_INT_EN_TX_EMPTY_EN << MXC_F_SPIXR_INT_EN_TX_EMPTY_POS) /**< INT_EN_TX_EMPTY_EN Setting */

#define MXC_F_SPIXR_INT_EN_RX_LEVEL_POS                2 /**< INT_EN_RX_LEVEL Position */
#define MXC_F_SPIXR_INT_EN_RX_LEVEL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_RX_LEVEL_POS)) /**< INT_EN_RX_LEVEL Mask */
#define MXC_V_SPIXR_INT_EN_RX_LEVEL_DIS                ((uint32_t)0x0UL) /**< INT_EN_RX_LEVEL_DIS Value */
#define MXC_S_SPIXR_INT_EN_RX_LEVEL_DIS                (MXC_V_SPIXR_INT_EN_RX_LEVEL_DIS << MXC_F_SPIXR_INT_EN_RX_LEVEL_POS) /**< INT_EN_RX_LEVEL_DIS Setting */
#define MXC_V_SPIXR_INT_EN_RX_LEVEL_EN                 ((uint32_t)0x1UL) /**< INT_EN_RX_LEVEL_EN Value */
#define MXC_S_SPIXR_INT_EN_RX_LEVEL_EN                 (MXC_V_SPIXR_INT_EN_RX_LEVEL_EN << MXC_F_SPIXR_INT_EN_RX_LEVEL_POS) /**< INT_EN_RX_LEVEL_EN Setting */

