analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixr_regs.h
#define MXC_F_SPIXR_INT_EN_RX_FULL_POS                 3 /**< INT_EN_RX_FULL Position */
#define MXC_F_SPIXR_INT_EN_RX_FULL                     ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_RX_FULL_POS)) /**< INT_EN_RX_FULL Mask */
#define MXC_V_SPIXR_INT_EN_RX_FULL_DIS                 ((uint32_t)0x0UL) /**< INT_EN_RX_FULL_DIS Value */
#define MXC_S_SPIXR_INT_EN_RX_FULL_DIS                 (MXC_V_SPIXR_INT_EN_RX_FULL_DIS << MXC_F_SPIXR_INT_EN_RX_FULL_POS) /**< INT_EN_RX_FULL_DIS Setting */
#define MXC_V_SPIXR_INT_EN_RX_FULL_EN                  ((uint32_t)0x1UL) /**< INT_EN_RX_FULL_EN Value */
#define MXC_S_SPIXR_INT_EN_RX_FULL_EN                  (MXC_V_SPIXR_INT_EN_RX_FULL_EN << MXC_F_SPIXR_INT_EN_RX_FULL_POS) /**< INT_EN_RX_FULL_EN Setting */

#define MXC_F_SPIXR_INT_EN_SSA_POS                     4 /**< INT_EN_SSA Position */
#define MXC_F_SPIXR_INT_EN_SSA                         ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_SSA_POS)) /**< INT_EN_SSA Mask */
#define MXC_V_SPIXR_INT_EN_SSA_DIS                     ((uint32_t)0x0UL) /**< INT_EN_SSA_DIS Value */
#define MXC_S_SPIXR_INT_EN_SSA_DIS                     (MXC_V_SPIXR_INT_EN_SSA_DIS << MXC_F_SPIXR_INT_EN_SSA_POS) /**< INT_EN_SSA_DIS Setting */
#define MXC_V_SPIXR_INT_EN_SSA_EN                      ((uint32_t)0x1UL) /**< INT_EN_SSA_EN Value */
#define MXC_S_SPIXR_INT_EN_SSA_EN                      (MXC_V_SPIXR_INT_EN_SSA_EN << MXC_F_SPIXR_INT_EN_SSA_POS) /**< INT_EN_SSA_EN Setting */

#define MXC_F_SPIXR_INT_EN_SSD_POS                     5 /**< INT_EN_SSD Position */
#define MXC_F_SPIXR_INT_EN_SSD                         ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_SSD_POS)) /**< INT_EN_SSD Mask */
#define MXC_V_SPIXR_INT_EN_SSD_DIS                     ((uint32_t)0x0UL) /**< INT_EN_SSD_DIS Value */
#define MXC_S_SPIXR_INT_EN_SSD_DIS                     (MXC_V_SPIXR_INT_EN_SSD_DIS << MXC_F_SPIXR_INT_EN_SSD_POS) /**< INT_EN_SSD_DIS Setting */
#define MXC_V_SPIXR_INT_EN_SSD_EN                      ((uint32_t)0x1UL) /**< INT_EN_SSD_EN Value */
#define MXC_S_SPIXR_INT_EN_SSD_EN                      (MXC_V_SPIXR_INT_EN_SSD_EN << MXC_F_SPIXR_INT_EN_SSD_POS) /**< INT_EN_SSD_EN Setting */

#define MXC_F_SPIXR_INT_EN_FAULT_POS                   8 /**< INT_EN_FAULT Position */
#define MXC_F_SPIXR_INT_EN_FAULT                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_FAULT_POS)) /**< INT_EN_FAULT Mask */
#define MXC_V_SPIXR_INT_EN_FAULT_DIS                   ((uint32_t)0x0UL) /**< INT_EN_FAULT_DIS Value */
#define MXC_S_SPIXR_INT_EN_FAULT_DIS                   (MXC_V_SPIXR_INT_EN_FAULT_DIS << MXC_F_SPIXR_INT_EN_FAULT_POS) /**< INT_EN_FAULT_DIS Setting */
#define MXC_V_SPIXR_INT_EN_FAULT_EN                    ((uint32_t)0x1UL) /**< INT_EN_FAULT_EN Value */
#define MXC_S_SPIXR_INT_EN_FAULT_EN                    (MXC_V_SPIXR_INT_EN_FAULT_EN << MXC_F_SPIXR_INT_EN_FAULT_POS) /**< INT_EN_FAULT_EN Setting */

#define MXC_F_SPIXR_INT_EN_ABORT_POS                   9 /**< INT_EN_ABORT Position */
#define MXC_F_SPIXR_INT_EN_ABORT                       ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_ABORT_POS)) /**< INT_EN_ABORT Mask */
#define MXC_V_SPIXR_INT_EN_ABORT_DIS                   ((uint32_t)0x0UL) /**< INT_EN_ABORT_DIS Value */
#define MXC_S_SPIXR_INT_EN_ABORT_DIS                   (MXC_V_SPIXR_INT_EN_ABORT_DIS << MXC_F_SPIXR_INT_EN_ABORT_POS) /**< INT_EN_ABORT_DIS Setting */
#define MXC_V_SPIXR_INT_EN_ABORT_EN                    ((uint32_t)0x1UL) /**< INT_EN_ABORT_EN Value */
#define MXC_S_SPIXR_INT_EN_ABORT_EN                    (MXC_V_SPIXR_INT_EN_ABORT_EN << MXC_F_SPIXR_INT_EN_ABORT_POS) /**< INT_EN_ABORT_EN Setting */

#define MXC_F_SPIXR_INT_EN_M_DONE_POS                  11 /**< INT_EN_M_DONE Position */
#define MXC_F_SPIXR_INT_EN_M_DONE                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_M_DONE_POS)) /**< INT_EN_M_DONE Mask */
#define MXC_V_SPIXR_INT_EN_M_DONE_DIS                  ((uint32_t)0x0UL) /**< INT_EN_M_DONE_DIS Value */
#define MXC_S_SPIXR_INT_EN_M_DONE_DIS                  (MXC_V_SPIXR_INT_EN_M_DONE_DIS << MXC_F_SPIXR_INT_EN_M_DONE_POS) /**< INT_EN_M_DONE_DIS Setting */
#define MXC_V_SPIXR_INT_EN_M_DONE_EN                   ((uint32_t)0x1UL) /**< INT_EN_M_DONE_EN Value */
#define MXC_S_SPIXR_INT_EN_M_DONE_EN                   (MXC_V_SPIXR_INT_EN_M_DONE_EN << MXC_F_SPIXR_INT_EN_M_DONE_POS) /**< INT_EN_M_DONE_EN Setting */

#define MXC_F_SPIXR_INT_EN_TX_OVR_POS                  12 /**< INT_EN_TX_OVR Position */
#define MXC_F_SPIXR_INT_EN_TX_OVR                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_TX_OVR_POS)) /**< INT_EN_TX_OVR Mask */
#define MXC_V_SPIXR_INT_EN_TX_OVR_DIS                  ((uint32_t)0x0UL) /**< INT_EN_TX_OVR_DIS Value */
#define MXC_S_SPIXR_INT_EN_TX_OVR_DIS                  (MXC_V_SPIXR_INT_EN_TX_OVR_DIS << MXC_F_SPIXR_INT_EN_TX_OVR_POS) /**< INT_EN_TX_OVR_DIS Setting */
#define MXC_V_SPIXR_INT_EN_TX_OVR_EN                   ((uint32_t)0x1UL) /**< INT_EN_TX_OVR_EN Value */
#define MXC_S_SPIXR_INT_EN_TX_OVR_EN                   (MXC_V_SPIXR_INT_EN_TX_OVR_EN << MXC_F_SPIXR_INT_EN_TX_OVR_POS) /**< INT_EN_TX_OVR_EN Setting */

#define MXC_F_SPIXR_INT_EN_TX_UND_POS                  13 /**< INT_EN_TX_UND Position */
#define MXC_F_SPIXR_INT_EN_TX_UND                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_TX_UND_POS)) /**< INT_EN_TX_UND Mask */
#define MXC_V_SPIXR_INT_EN_TX_UND_DIS                  ((uint32_t)0x0UL) /**< INT_EN_TX_UND_DIS Value */
#define MXC_S_SPIXR_INT_EN_TX_UND_DIS                  (MXC_V_SPIXR_INT_EN_TX_UND_DIS << MXC_F_SPIXR_INT_EN_TX_UND_POS) /**< INT_EN_TX_UND_DIS Setting */
#define MXC_V_SPIXR_INT_EN_TX_UND_EN                   ((uint32_t)0x1UL) /**< INT_EN_TX_UND_EN Value */
#define MXC_S_SPIXR_INT_EN_TX_UND_EN                   (MXC_V_SPIXR_INT_EN_TX_UND_EN << MXC_F_SPIXR_INT_EN_TX_UND_POS) /**< INT_EN_TX_UND_EN Setting */

#define MXC_F_SPIXR_INT_EN_RX_OVR_POS                  14 /**< INT_EN_RX_OVR Position */
#define MXC_F_SPIXR_INT_EN_RX_OVR                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_RX_OVR_POS)) /**< INT_EN_RX_OVR Mask */
#define MXC_V_SPIXR_INT_EN_RX_OVR_DIS                  ((uint32_t)0x0UL) /**< INT_EN_RX_OVR_DIS Value */
#define MXC_S_SPIXR_INT_EN_RX_OVR_DIS                  (MXC_V_SPIXR_INT_EN_RX_OVR_DIS << MXC_F_SPIXR_INT_EN_RX_OVR_POS) /**< INT_EN_RX_OVR_DIS Setting */
#define MXC_V_SPIXR_INT_EN_RX_OVR_EN                   ((uint32_t)0x1UL) /**< INT_EN_RX_OVR_EN Value */
#define MXC_S_SPIXR_INT_EN_RX_OVR_EN                   (MXC_V_SPIXR_INT_EN_RX_OVR_EN << MXC_F_SPIXR_INT_EN_RX_OVR_POS) /**< INT_EN_RX_OVR_EN Setting */

#define MXC_F_SPIXR_INT_EN_RX_UND_POS                  15 /**< INT_EN_RX_UND Position */
#define MXC_F_SPIXR_INT_EN_RX_UND                      ((uint32_t)(0x1UL << MXC_F_SPIXR_INT_EN_RX_UND_POS)) /**< INT_EN_RX_UND Mask */
#define MXC_V_SPIXR_INT_EN_RX_UND_DIS                  ((uint32_t)0x0UL) /**< INT_EN_RX_UND_DIS Value */
#define MXC_S_SPIXR_INT_EN_RX_UND_DIS                  (MXC_V_SPIXR_INT_EN_RX_UND_DIS << MXC_F_SPIXR_INT_EN_RX_UND_POS) /**< INT_EN_RX_UND_DIS Setting */
#define MXC_V_SPIXR_INT_EN_RX_UND_EN                   ((uint32_t)0x1UL) /**< INT_EN_RX_UND_EN Value */
#define MXC_S_SPIXR_INT_EN_RX_UND_EN                   (MXC_V_SPIXR_INT_EN_RX_UND_EN << MXC_F_SPIXR_INT_EN_RX_UND_POS) /**< INT_EN_RX_UND_EN Setting */

/**@} end of group SPIXR_INT_EN_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WAKE_FL SPIXR_WAKE_FL
 * @brief    Register for wake up flags. All bits in this register are write 1 to clear.
 * @{
 */
#define MXC_F_SPIXR_WAKE_FL_TX_LEVEL_POS               0 /**< WAKE_FL_TX_LEVEL Position */
#define MXC_F_SPIXR_WAKE_FL_TX_LEVEL                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_FL_TX_LEVEL_POS)) /**< WAKE_FL_TX_LEVEL Mask */
#define MXC_V_SPIXR_WAKE_FL_TX_LEVEL_CLEAR             ((uint32_t)0x1UL) /**< WAKE_FL_TX_LEVEL_CLEAR Value */
#define MXC_S_SPIXR_WAKE_FL_TX_LEVEL_CLEAR             (MXC_V_SPIXR_WAKE_FL_TX_LEVEL_CLEAR << MXC_F_SPIXR_WAKE_FL_TX_LEVEL_POS) /**< WAKE_FL_TX_LEVEL_CLEAR Setting */

