analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixr_regs.h
#define MXC_F_SPIXR_WAKE_FL_TX_EMPTY_POS               1 /**< WAKE_FL_TX_EMPTY Position */
#define MXC_F_SPIXR_WAKE_FL_TX_EMPTY                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_FL_TX_EMPTY_POS)) /**< WAKE_FL_TX_EMPTY Mask */
#define MXC_V_SPIXR_WAKE_FL_TX_EMPTY_CLEAR             ((uint32_t)0x1UL) /**< WAKE_FL_TX_EMPTY_CLEAR Value */
#define MXC_S_SPIXR_WAKE_FL_TX_EMPTY_CLEAR             (MXC_V_SPIXR_WAKE_FL_TX_EMPTY_CLEAR << MXC_F_SPIXR_WAKE_FL_TX_EMPTY_POS) /**< WAKE_FL_TX_EMPTY_CLEAR Setting */

#define MXC_F_SPIXR_WAKE_FL_RX_LEVEL_POS               2 /**< WAKE_FL_RX_LEVEL Position */
#define MXC_F_SPIXR_WAKE_FL_RX_LEVEL                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_FL_RX_LEVEL_POS)) /**< WAKE_FL_RX_LEVEL Mask */
#define MXC_V_SPIXR_WAKE_FL_RX_LEVEL_CLEAR             ((uint32_t)0x1UL) /**< WAKE_FL_RX_LEVEL_CLEAR Value */
#define MXC_S_SPIXR_WAKE_FL_RX_LEVEL_CLEAR             (MXC_V_SPIXR_WAKE_FL_RX_LEVEL_CLEAR << MXC_F_SPIXR_WAKE_FL_RX_LEVEL_POS) /**< WAKE_FL_RX_LEVEL_CLEAR Setting */

#define MXC_F_SPIXR_WAKE_FL_RX_FULL_POS                3 /**< WAKE_FL_RX_FULL Position */
#define MXC_F_SPIXR_WAKE_FL_RX_FULL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_FL_RX_FULL_POS)) /**< WAKE_FL_RX_FULL Mask */
#define MXC_V_SPIXR_WAKE_FL_RX_FULL_CLEAR              ((uint32_t)0x1UL) /**< WAKE_FL_RX_FULL_CLEAR Value */
#define MXC_S_SPIXR_WAKE_FL_RX_FULL_CLEAR              (MXC_V_SPIXR_WAKE_FL_RX_FULL_CLEAR << MXC_F_SPIXR_WAKE_FL_RX_FULL_POS) /**< WAKE_FL_RX_FULL_CLEAR Setting */

/**@} end of group SPIXR_WAKE_FL_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WAKE_EN SPIXR_WAKE_EN
 * @brief    Register for wake up enable.
 * @{
 */
#define MXC_F_SPIXR_WAKE_EN_TX_LEVEL_POS               0 /**< WAKE_EN_TX_LEVEL Position */
#define MXC_F_SPIXR_WAKE_EN_TX_LEVEL                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_EN_TX_LEVEL_POS)) /**< WAKE_EN_TX_LEVEL Mask */
#define MXC_V_SPIXR_WAKE_EN_TX_LEVEL_DIS               ((uint32_t)0x0UL) /**< WAKE_EN_TX_LEVEL_DIS Value */
#define MXC_S_SPIXR_WAKE_EN_TX_LEVEL_DIS               (MXC_V_SPIXR_WAKE_EN_TX_LEVEL_DIS << MXC_F_SPIXR_WAKE_EN_TX_LEVEL_POS) /**< WAKE_EN_TX_LEVEL_DIS Setting */
#define MXC_V_SPIXR_WAKE_EN_TX_LEVEL_EN                ((uint32_t)0x1UL) /**< WAKE_EN_TX_LEVEL_EN Value */
#define MXC_S_SPIXR_WAKE_EN_TX_LEVEL_EN                (MXC_V_SPIXR_WAKE_EN_TX_LEVEL_EN << MXC_F_SPIXR_WAKE_EN_TX_LEVEL_POS) /**< WAKE_EN_TX_LEVEL_EN Setting */

#define MXC_F_SPIXR_WAKE_EN_TX_EMPTY_POS               1 /**< WAKE_EN_TX_EMPTY Position */
#define MXC_F_SPIXR_WAKE_EN_TX_EMPTY                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_EN_TX_EMPTY_POS)) /**< WAKE_EN_TX_EMPTY Mask */
#define MXC_V_SPIXR_WAKE_EN_TX_EMPTY_DIS               ((uint32_t)0x0UL) /**< WAKE_EN_TX_EMPTY_DIS Value */
#define MXC_S_SPIXR_WAKE_EN_TX_EMPTY_DIS               (MXC_V_SPIXR_WAKE_EN_TX_EMPTY_DIS << MXC_F_SPIXR_WAKE_EN_TX_EMPTY_POS) /**< WAKE_EN_TX_EMPTY_DIS Setting */
#define MXC_V_SPIXR_WAKE_EN_TX_EMPTY_EN                ((uint32_t)0x1UL) /**< WAKE_EN_TX_EMPTY_EN Value */
#define MXC_S_SPIXR_WAKE_EN_TX_EMPTY_EN                (MXC_V_SPIXR_WAKE_EN_TX_EMPTY_EN << MXC_F_SPIXR_WAKE_EN_TX_EMPTY_POS) /**< WAKE_EN_TX_EMPTY_EN Setting */

#define MXC_F_SPIXR_WAKE_EN_RX_LEVEL_POS               2 /**< WAKE_EN_RX_LEVEL Position */
#define MXC_F_SPIXR_WAKE_EN_RX_LEVEL                   ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_EN_RX_LEVEL_POS)) /**< WAKE_EN_RX_LEVEL Mask */
#define MXC_V_SPIXR_WAKE_EN_RX_LEVEL_DIS               ((uint32_t)0x0UL) /**< WAKE_EN_RX_LEVEL_DIS Value */
#define MXC_S_SPIXR_WAKE_EN_RX_LEVEL_DIS               (MXC_V_SPIXR_WAKE_EN_RX_LEVEL_DIS << MXC_F_SPIXR_WAKE_EN_RX_LEVEL_POS) /**< WAKE_EN_RX_LEVEL_DIS Setting */
#define MXC_V_SPIXR_WAKE_EN_RX_LEVEL_EN                ((uint32_t)0x1UL) /**< WAKE_EN_RX_LEVEL_EN Value */
#define MXC_S_SPIXR_WAKE_EN_RX_LEVEL_EN                (MXC_V_SPIXR_WAKE_EN_RX_LEVEL_EN << MXC_F_SPIXR_WAKE_EN_RX_LEVEL_POS) /**< WAKE_EN_RX_LEVEL_EN Setting */

#define MXC_F_SPIXR_WAKE_EN_RX_FULL_POS                3 /**< WAKE_EN_RX_FULL Position */
#define MXC_F_SPIXR_WAKE_EN_RX_FULL                    ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_EN_RX_FULL_POS)) /**< WAKE_EN_RX_FULL Mask */
#define MXC_V_SPIXR_WAKE_EN_RX_FULL_DIS                ((uint32_t)0x0UL) /**< WAKE_EN_RX_FULL_DIS Value */
#define MXC_S_SPIXR_WAKE_EN_RX_FULL_DIS                (MXC_V_SPIXR_WAKE_EN_RX_FULL_DIS << MXC_F_SPIXR_WAKE_EN_RX_FULL_POS) /**< WAKE_EN_RX_FULL_DIS Setting */
#define MXC_V_SPIXR_WAKE_EN_RX_FULL_EN                 ((uint32_t)0x1UL) /**< WAKE_EN_RX_FULL_EN Value */
#define MXC_S_SPIXR_WAKE_EN_RX_FULL_EN                 (MXC_V_SPIXR_WAKE_EN_RX_FULL_EN << MXC_F_SPIXR_WAKE_EN_RX_FULL_POS) /**< WAKE_EN_RX_FULL_EN Setting */

/**@} end of group SPIXR_WAKE_EN_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_STAT SPIXR_STAT
 * @brief    SPI Status register.
 * @{
 */
#define MXC_F_SPIXR_STAT_BUSY_POS                      0 /**< STAT_BUSY Position */
#define MXC_F_SPIXR_STAT_BUSY                          ((uint32_t)(0x1UL << MXC_F_SPIXR_STAT_BUSY_POS)) /**< STAT_BUSY Mask */
#define MXC_V_SPIXR_STAT_BUSY_NOTACTIVE                ((uint32_t)0x0UL) /**< STAT_BUSY_NOTACTIVE Value */
#define MXC_S_SPIXR_STAT_BUSY_NOTACTIVE                (MXC_V_SPIXR_STAT_BUSY_NOTACTIVE << MXC_F_SPIXR_STAT_BUSY_POS) /**< STAT_BUSY_NOTACTIVE Setting */
#define MXC_V_SPIXR_STAT_BUSY_ACTIVE                   ((uint32_t)0x1UL) /**< STAT_BUSY_ACTIVE Value */
#define MXC_S_SPIXR_STAT_BUSY_ACTIVE                   (MXC_V_SPIXR_STAT_BUSY_ACTIVE << MXC_F_SPIXR_STAT_BUSY_POS) /**< STAT_BUSY_ACTIVE Setting */

/**@} end of group SPIXR_STAT_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_XMEM_CTRL SPIXR_XMEM_CTRL
 * @brief    Register to control external memory.
 * @{
 */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_RD_CMD_POS          0 /**< XMEM_CTRL_XMEM_RD_CMD Position */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_RD_CMD              ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_XMEM_RD_CMD_POS)) /**< XMEM_CTRL_XMEM_RD_CMD Mask */

#define MXC_F_SPIXR_XMEM_CTRL_XMEM_WR_CMD_POS          8 /**< XMEM_CTRL_XMEM_WR_CMD Position */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_WR_CMD              ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_XMEM_WR_CMD_POS)) /**< XMEM_CTRL_XMEM_WR_CMD Mask */

#define MXC_F_SPIXR_XMEM_CTRL_XMEM_DCLKS_POS           16 /**< XMEM_CTRL_XMEM_DCLKS Position */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_DCLKS               ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_XMEM_DCLKS_POS)) /**< XMEM_CTRL_XMEM_DCLKS Mask */

#define MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS              31 /**< XMEM_CTRL_XMEM_EN Position */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_EN                  ((uint32_t)(0x1UL << MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS)) /**< XMEM_CTRL_XMEM_EN Mask */
#define MXC_V_SPIXR_XMEM_CTRL_XMEM_EN_DIS              ((uint32_t)0x0UL) /**< XMEM_CTRL_XMEM_EN_DIS Value */
#define MXC_S_SPIXR_XMEM_CTRL_XMEM_EN_DIS              (MXC_V_SPIXR_XMEM_CTRL_XMEM_EN_DIS << MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS) /**< XMEM_CTRL_XMEM_EN_DIS Setting */
#define MXC_V_SPIXR_XMEM_CTRL_XMEM_EN_EN               ((uint32_t)0x1UL) /**< XMEM_CTRL_XMEM_EN_EN Value */
#define MXC_S_SPIXR_XMEM_CTRL_XMEM_EN_EN               (MXC_V_SPIXR_XMEM_CTRL_XMEM_EN_EN << MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS) /**< XMEM_CTRL_XMEM_EN_EN Setting */

/**@} end of group SPIXR_XMEM_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIXR_REGS_H_
